Revit 2024 API
ImagePlacementOptions.Location Property
 The location in the model where a point of the ImageInstance, determined by the PlacementPoint property, is going to be inserted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public XYZ Location { get; set; }
Visual Basic
Public Property Location As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ Location {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 The location represents a point in the model where the ImageInstance will be placed. The location of the image in the view is determined by the projection of this point onto the plane of the view. This means that in a plan view, for example, the z-coordinate has no effect.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ImagePlacementOptions Class
Autodesk.Revit.DB Namespace